[
  {
    "id": 1,
    "title": "Senior Machine Learning Engineer",
    "company": "Google DeepMind",
    "location": "Mountain View, CA",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Join our research team building next-generation AI systems. You'll develop novel ML architectures, work on large language models, and deploy models at massive scale serving billions of users. Collaborate with world-class researchers and engineers to push the boundaries of what's possible with AI.",
    "requirements": "Python, TensorFlow, PyTorch, Deep Learning, Neural Networks, NLP, Computer Vision, Distributed Training, Model Optimization, Research experience, 5+ years ML engineering",
    "salary": "$200,000 - $350,000",
    "education_required": "Master's or PhD in Computer Science, Machine Learning, or related field",
    "projects_required": "Published research papers, open-source contributions, or production ML systems at scale"
  },
  {
    "id": 2,
    "title": "ML Engineer",
    "company": "Meta (Facebook)",
    "location": "Menlo Park, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build recommendation systems that power Facebook, Instagram, and WhatsApp. Work on personalization algorithms, ranking models, and content understanding using state-of-the-art ML techniques. Your work will impact billions of users daily.",
    "requirements": "Python, PyTorch or TensorFlow, Machine Learning, Deep Learning, Recommendation Systems, A/B Testing, SQL, Spark, 3+ years experience building production ML systems",
    "salary": "$180,000 - $280,000",
    "education_required": "Bachelor's or Master's in Computer Science or related field",
    "projects_required": "Experience with large-scale ML systems, preferably in recommendations or ranking"
  },
  {
    "id": 3,
    "title": "Junior Machine Learning Engineer",
    "company": "Spotify",
    "location": "New York, NY",
    "type": "Full-time",
    "experience": "1-2",
    "visa_sponsorship": true,
    "description": "Join our personalization team to improve music and podcast recommendations. Learn from senior ML engineers while contributing to real production systems. Work on audio analysis, natural language processing, and collaborative filtering.",
    "requirements": "Python, Machine Learning fundamentals, TensorFlow or PyTorch, SQL, Basic NLP, 1-2 years of experience or strong internship background",
    "salary": "$120,000 - $160,000",
    "education_required": "Bachelor's in Computer Science, Statistics, or related field",
    "projects_required": "Academic projects or personal ML projects demonstrating hands-on experience"
  },
  {
    "id": 4,
    "title": "Staff Machine Learning Engineer",
    "company": "OpenAI",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "8+",
    "visa_sponsorship": true,
    "description": "Lead the development of large language models and multimodal AI systems. Define technical strategy, mentor engineers, and work on cutting-edge research. You'll have significant impact on products used by millions including ChatGPT and DALL-E.",
    "requirements": "Python, PyTorch, Transformers, Large Language Models, Distributed Training (multi-GPU/multi-node), Model Architecture Design, Research background, 8+ years ML engineering with 3+ years in leadership",
    "salary": "$300,000 - $500,000+",
    "education_required": "PhD in Computer Science, Machine Learning, or equivalent experience",
    "projects_required": "Track record of major contributions to ML systems, published papers at top conferences (NeurIPS, ICML, ICLR)"
  },
  {
    "id": 5,
    "title": "Applied ML Scientist",
    "company": "Amazon",
    "location": "Seattle, WA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Work on Alexa's natural language understanding and speech recognition. Develop and deploy ML models for voice interfaces, work with massive datasets, and optimize models for edge devices. Balance cutting-edge research with practical product requirements.",
    "requirements": "Python, Deep Learning, NLP, Speech Recognition, PyTorch or TensorFlow, AWS, Model Compression, MLOps, 4+ years experience in applied ML",
    "salary": "$175,000 - $250,000",
    "education_required": "Master's or PhD in Machine Learning, Computer Science, or related field",
    "projects_required": "Experience deploying ML models to production, preferably in NLP or speech"
  },
  {
    "id": 6,
    "title": "Computer Vision Engineer",
    "company": "Tesla",
    "location": "Palo Alto, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": false,
    "description": "Develop neural networks for autonomous driving perception. Work on object detection, tracking, and scene understanding using camera and sensor fusion. Your code will run on millions of Tesla vehicles worldwide.",
    "requirements": "Python, Computer Vision, Deep Learning, PyTorch, OpenCV, Object Detection, Semantic Segmentation, Real-time systems, C++, 3+ years CV experience",
    "salary": "$170,000 - $240,000",
    "education_required": "Bachelor's or Master's in Computer Science, Robotics, or related field",
    "projects_required": "Portfolio demonstrating computer vision expertise, preferably in autonomous systems"
  },
  {
    "id": 7,
    "title": "MLOps Engineer",
    "company": "Netflix",
    "location": "Los Gatos, CA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Build infrastructure and tools for ML model deployment at Netflix scale. Create pipelines for training, evaluation, and serving models. Work with data scientists and ML engineers to streamline the path from research to production.",
    "requirements": "Python, Kubernetes, Docker, AWS, ML frameworks (TensorFlow/PyTorch), CI/CD, Monitoring tools, Feature stores, 4+ years MLOps or DevOps experience",
    "salary": "$165,000 - $230,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience building ML infrastructure and deployment pipelines"
  },
  {
    "id": 8,
    "title": "Research Scientist - AI",
    "company": "Microsoft Research",
    "location": "Redmond, WA",
    "type": "Full-time",
    "experience": "PhD or 5+",
    "visa_sponsorship": true,
    "description": "Conduct fundamental research in machine learning and AI. Publish at top-tier conferences, collaborate with academia, and transition research into Microsoft products. Focus areas include reinforcement learning, multimodal learning, and AI safety.",
    "requirements": "PhD in Machine Learning or Computer Science, Strong publication record (NeurIPS, ICML, CVPR), PyTorch or TensorFlow, Research experience in AI, Strong mathematical background",
    "salary": "$180,000 - $300,000",
    "education_required": "PhD in Machine Learning, Computer Science, Statistics, or related field",
    "projects_required": "Published papers at top ML conferences, preferably as first author"
  },
  {
    "id": 9,
    "title": "NLP Engineer",
    "company": "Grammarly",
    "location": "Remote (US)",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": false,
    "description": "Build NLP models for grammar checking, style suggestions, and tone detection. Work with transformers, fine-tune large language models, and optimize for real-time performance. Improve writing for 30+ million daily users.",
    "requirements": "Python, NLP, Transformers, BERT, GPT, spaCy, Fine-tuning, Model serving, 3+ years NLP experience",
    "salary": "$150,000 - $210,000",
    "education_required": "Bachelor's or Master's in Computer Science, Computational Linguistics, or related field",
    "projects_required": "NLP projects or products, experience with language models"
  },
  {
    "id": 10,
    "title": "Machine Learning Intern",
    "company": "Apple",
    "location": "Cupertino, CA",
    "type": "Internship",
    "experience": "0-1",
    "visa_sponsorship": true,
    "description": "12-week summer internship working on Siri's ML infrastructure. Contribute to real projects in natural language understanding, speech recognition, or on-device ML. Mentorship from senior engineers and opportunity for full-time conversion.",
    "requirements": "Python, Machine Learning coursework, PyTorch or TensorFlow, Strong CS fundamentals, Currently pursuing Bachelor's or Master's in CS/ML",
    "salary": "$8,000 - $10,000/month",
    "education_required": "Currently enrolled in Bachelor's or Master's program in Computer Science or related field",
    "projects_required": "Academic ML projects, Kaggle competitions, or personal projects"
  },
  {
    "id": 11,
    "title": "Senior Software Engineer - Backend",
    "company": "Stripe",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Build scalable payment infrastructure processing billions of dollars. Design APIs, work on distributed systems, and ensure 99.99% uptime. Work with Ruby, Go, and modern cloud infrastructure.",
    "requirements": "Ruby, Go or Java, Distributed Systems, PostgreSQL, Redis, API Design, Microservices, 5+ years backend development",
    "salary": "$190,000 - $280,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Experience building high-scale distributed systems"
  },
  {
    "id": 12,
    "title": "Software Engineer II",
    "company": "Microsoft",
    "location": "Redmond, WA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Work on Azure cloud services. Build features for compute, storage, or networking. Write C# and Go, deploy at massive scale, and collaborate across teams.",
    "requirements": "C# or Java, Go, Azure or AWS, Kubernetes, Docker, REST APIs, 3+ years software development",
    "salary": "$140,000 - $200,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience with cloud platforms and scalable services"
  },
  {
    "id": 13,
    "title": "Junior Software Engineer",
    "company": "Airbnb",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "0-2",
    "visa_sponsorship": false,
    "description": "Join our platform team building tools for thousands of engineers. Learn from senior engineers, contribute to open-source projects, and work on real production systems serving millions.",
    "requirements": "Java or Python, React or similar framework, SQL, Git, Strong CS fundamentals, 0-2 years experience",
    "salary": "$130,000 - $170,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Personal projects, internships, or open-source contributions"
  },
  {
    "id": 14,
    "title": "Principal Engineer",
    "company": "Uber",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "12+",
    "visa_sponsorship": true,
    "description": "Lead architecture for Uber's marketplace platform. Define technical strategy, mentor staff engineers, and drive cross-org initiatives. Solve problems at billion-user scale.",
    "requirements": "Deep expertise in distributed systems, 12+ years software engineering, Go/Java/Python, System design mastery, Leadership experience, Track record of technical impact",
    "salary": "$300,000 - $500,000+",
    "education_required": "Bachelor's or higher in Computer Science, or equivalent experience",
    "projects_required": "Led major technical initiatives with company-wide impact"
  },
  {
    "id": 15,
    "title": "Backend Engineer - Payments",
    "company": "Square",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Build payment processing systems for millions of merchants. Work on fraud detection, transaction processing, and financial infrastructure. High reliability and security critical.",
    "requirements": "Ruby, Java, or Go, PostgreSQL, Redis, Payment systems knowledge, 4+ years backend development, Strong testing practices",
    "salary": "$160,000 - $230,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience with financial or payment systems preferred"
  },
  {
    "id": 16,
    "title": "Staff Software Engineer - Infrastructure",
    "company": "Lyft",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "8+",
    "visa_sponsorship": true,
    "description": "Lead infrastructure initiatives serving Lyft's entire engineering org. Build developer tools, CI/CD pipelines, and cloud infrastructure. Mentor engineers and drive technical excellence.",
    "requirements": "Go or Python, Kubernetes, AWS, Terraform, Infrastructure as Code, Monitoring, 8+ years experience with 3+ in infrastructure/platform",
    "salary": "$240,000 - $350,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Led infrastructure projects impacting hundreds of engineers"
  },
  {
    "id": 17,
    "title": "Software Engineer - Mobile",
    "company": "Instagram",
    "location": "Menlo Park, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build Instagram's iOS and Android apps used by over 2 billion people. Work on performance, new features, and user experience. Collaborate with designers and product managers.",
    "requirements": "Swift or Kotlin, iOS or Android development, React Native, Mobile architecture, 3+ years mobile development",
    "salary": "$160,000 - $240,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Published mobile apps or significant contributions to mobile projects"
  },
  {
    "id": 18,
    "title": "Senior Frontend Engineer",
    "company": "Figma",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Build Figma's collaborative design tool using WebGL and React. Work on real-time collaboration, performance optimization, and user experience. Push the boundaries of what's possible in the browser.",
    "requirements": "JavaScript/TypeScript, React, WebGL or Canvas, Performance optimization, Real-time systems, 5+ years frontend development",
    "salary": "$180,000 - $260,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Portfolio of complex web applications, preferably with real-time features"
  },
  {
    "id": 19,
    "title": "Software Development Engineer",
    "company": "Amazon Web Services",
    "location": "Seattle, WA",
    "type": "Full-time",
    "experience": "2+",
    "visa_sponsorship": true,
    "description": "Work on AWS services like EC2, S3, or Lambda. Build features used by millions of customers worldwide. Own services from design to deployment.",
    "requirements": "Java or C++, Distributed systems, Linux, Networking, AWS services, 2+ years software development",
    "salary": "$130,000 - $190,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience with cloud services or distributed systems"
  },
  {
    "id": 20,
    "title": "Senior Data Scientist",
    "company": "Spotify",
    "location": "New York, NY",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Drive product decisions with data. Build models for user engagement, conduct A/B tests, and work with product teams. Influence how millions discover music.",
    "requirements": "Python, R, SQL, Machine Learning, Statistical Analysis, A/B Testing, Data Visualization, Causal Inference, 5+ years data science experience",
    "salary": "$170,000 - $240,000",
    "education_required": "Master's or PhD in Statistics, Economics, Computer Science, or related quantitative field",
    "projects_required": "Track record of data-driven product impact"
  },
  {
    "id": 21,
    "title": "Data Scientist",
    "company": "Netflix",
    "location": "Los Gatos, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Analyze viewer behavior and optimize content recommendations. Work on experimentation, causal inference, and personalization algorithms. Partner with ML engineers and product teams.",
    "requirements": "Python, SQL, Statistics, Machine Learning, A/B Testing, Spark, 3+ years data science experience",
    "salary": "$150,000 - $220,000",
    "education_required": "Master's in Statistics, Data Science, or related field",
    "projects_required": "Experience with experimentation and product analytics"
  },
  {
    "id": 22,
    "title": "Junior Data Scientist",
    "company": "Uber",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "1-2",
    "visa_sponsorship": false,
    "description": "Support data-driven decision making for Uber's marketplace. Build dashboards, conduct analyses, and learn from senior data scientists. Work on real problems affecting millions of riders and drivers.",
    "requirements": "Python or R, SQL, Statistics basics, Data visualization, 1-2 years experience or strong internship",
    "salary": "$110,000 - $150,000",
    "education_required": "Bachelor's or Master's in Statistics, Math, Economics, or related field",
    "projects_required": "Academic projects or data analysis portfolio"
  },
  {
    "id": 23,
    "title": "Staff Data Scientist",
    "company": "Airbnb",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "8+",
    "visa_sponsorship": true,
    "description": "Lead data science strategy for a major product area. Mentor data scientists, set technical direction, and partner with leadership. Drive high-impact projects affecting millions of hosts and guests.",
    "requirements": "Python, R, SQL, Advanced Statistics, Machine Learning, Causal Inference, Leadership, 8+ years data science with 2+ in senior roles",
    "salary": "$230,000 - $340,000",
    "education_required": "PhD in Statistics, Economics, or related field preferred",
    "projects_required": "Led major data science initiatives with measurable business impact"
  },
  {
    "id": 24,
    "title": "Data Scientist - Growth",
    "company": "LinkedIn",
    "location": "Sunnyvale, CA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Drive user growth through data-driven experiments. Analyze user behavior, design experiments, and build growth models. Work at the intersection of data science and product.",
    "requirements": "Python, SQL, Statistics, A/B Testing, Growth modeling, Product analytics, 4+ years data science experience",
    "salary": "$155,000 - $230,000",
    "education_required": "Master's in Statistics, Economics, or related field",
    "projects_required": "Experience with growth analytics and experimentation"
  },
  {
    "id": 25,
    "title": "Applied Research Scientist",
    "company": "Meta AI",
    "location": "Menlo Park, CA",
    "type": "Full-time",
    "experience": "PhD or 5+",
    "visa_sponsorship": true,
    "description": "Bridge research and product. Develop novel ML algorithms and deploy them to billions of users. Publish papers while building real-world systems.",
    "requirements": "PhD in ML/CS or 5+ years experience, PyTorch, Deep Learning, NLP or Computer Vision, Publications, Research to production experience",
    "salary": "$190,000 - $320,000",
    "education_required": "PhD in Machine Learning, Computer Science, or equivalent experience",
    "projects_required": "Published research and experience deploying models to production"
  },
  {
    "id": 26,
    "title": "Analytics Engineer",
    "company": "dbt Labs",
    "location": "Remote (US)",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": false,
    "description": "Build data models and transformations using dbt. Work with data teams to enable self-service analytics. Create robust data pipelines and documentation.",
    "requirements": "SQL (expert level), dbt, Python, Data modeling, Snowflake or BigQuery, Version control, 3+ years data engineering or analytics",
    "salary": "$140,000 - $190,000",
    "education_required": "Bachelor's in Computer Science, Statistics, or related field",
    "projects_required": "Experience building data pipelines and analytics infrastructure"
  },
  {
    "id": 27,
    "title": "Senior Data Engineer",
    "company": "Snowflake",
    "location": "San Mateo, CA",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Build data infrastructure and ETL pipelines. Work with Spark, Airflow, and cloud data warehouses. Enable data scientists and analysts with reliable, scalable data.",
    "requirements": "Python or Scala, Spark, Airflow, SQL, Snowflake or Redshift, ETL/ELT, 5+ years data engineering",
    "salary": "$170,000 - $250,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Built large-scale data pipelines processing terabytes of data"
  },
  {
    "id": 28,
    "title": "Full Stack Engineer",
    "company": "Notion",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build features across the entire stack - from React frontend to Node.js backend to PostgreSQL database. Work on real-time collaboration and performance.",
    "requirements": "JavaScript/TypeScript, React, Node.js, PostgreSQL, Real-time systems, 3+ years full stack development",
    "salary": "$150,000 - $220,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Full stack projects demonstrating end-to-end development skills"
  },
  {
    "id": 29,
    "title": "Senior Full Stack Developer",
    "company": "Shopify",
    "location": "Ottawa, Canada",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Build merchant-facing features for Shopify's e-commerce platform. Work with Ruby on Rails, React, and GraphQL. Impact millions of merchants worldwide.",
    "requirements": "Ruby on Rails, React, JavaScript/TypeScript, GraphQL, PostgreSQL, Redis, 5+ years full stack development",
    "salary": "$140,000 - $200,000 CAD",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Experience with e-commerce or high-traffic web applications"
  },
  {
    "id": 30,
    "title": "Full Stack Engineer - Platform",
    "company": "Vercel",
    "location": "Remote (Global)",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Build the platform that powers Next.js and Vercel. Work on serverless infrastructure, developer tools, and performance optimization. Remote-first culture.",
    "requirements": "TypeScript, React, Next.js, Node.js, Serverless, Edge computing, 4+ years full stack development",
    "salary": "$160,000 - $230,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Experience with modern web frameworks and cloud platforms"
  },
  {
    "id": 31,
    "title": "Junior Full Stack Developer",
    "company": "GitLab",
    "location": "Remote (US)",
    "type": "Full-time",
    "experience": "1-2",
    "visa_sponsorship": false,
    "description": "Contribute to GitLab's open-source DevOps platform. Work with Ruby on Rails and Vue.js. Learn from experienced engineers in a remote-first, async culture.",
    "requirements": "Ruby or Python, JavaScript, Vue.js or React, Git, SQL, 1-2 years development experience",
    "salary": "$100,000 - $140,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Open-source contributions or personal full stack projects"
  },
  {
    "id": 32,
    "title": "Staff Full Stack Engineer",
    "company": "Slack",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "8+",
    "visa_sponsorship": true,
    "description": "Lead technical initiatives across Slack's platform. Mentor engineers, drive architecture decisions, and solve complex scaling challenges. Work on features used by millions daily.",
    "requirements": "JavaScript/TypeScript, React, Node.js, PHP or Java, Distributed systems, 8+ years full stack with 2+ in senior roles",
    "salary": "$220,000 - $340,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Led major technical projects with significant user impact"
  },
  {
    "id": 33,
    "title": "Full Stack Software Engineer",
    "company": "Asana",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build features for Asana's work management platform. Work across the stack with TypeScript, React, and Node.js. Focus on product quality and user experience.",
    "requirements": "TypeScript, React, Node.js, PostgreSQL, Redis, 3+ years full stack development",
    "salary": "$145,000 - $210,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Full stack applications with focus on user experience"
  },
  {
    "id": 34,
    "title": "Senior DevOps Engineer",
    "company": "HashiCorp",
    "location": "Remote (US)",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Build infrastructure tools and automation. Work with Terraform, Kubernetes, and cloud platforms. Help companies adopt modern DevOps practices.",
    "requirements": "Terraform, Kubernetes, Docker, AWS/Azure/GCP, Go or Python, CI/CD, Infrastructure as Code, 5+ years DevOps",
    "salary": "$160,000 - $230,000",
    "education_required": "Bachelor's in Computer Science or equivalent experience",
    "projects_required": "Built infrastructure automation and deployed to production"
  },
  {
    "id": 35,
    "title": "Site Reliability Engineer",
    "company": "Google",
    "location": "Mountain View, CA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": true,
    "description": "Ensure reliability of Google services serving billions. Build monitoring, automation, and scalability solutions. On-call rotation with excellent work-life balance.",
    "requirements": "Python or Go, Linux, Kubernetes, Monitoring (Prometheus/Grafana), Incident response, 4+ years SRE or DevOps",
    "salary": "$170,000 - $260,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience running large-scale production systems"
  },
  {
    "id": 36,
    "title": "Cloud Engineer",
    "company": "Databricks",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build and maintain cloud infrastructure for Databricks platform. Work with AWS, Azure, and GCP. Automate everything and ensure 99.9% uptime.",
    "requirements": "Terraform, Kubernetes, AWS/Azure/GCP, Python or Go, Networking, Security, 3+ years cloud engineering",
    "salary": "$150,000 - $220,000",
    "education_required": "Bachelor's in Computer Science or related field",
    "projects_required": "Experience with multi-cloud deployments"
  },
  {
    "id": 37,
    "title": "Technical Product Manager",
    "company": "Atlassian",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "5+",
    "visa_sponsorship": true,
    "description": "Lead product development for Jira or Confluence. Define roadmap, work with engineering teams, and drive product strategy. Strong technical background required.",
    "requirements": "Software engineering background, Product management, API design, Agile/Scrum, Data analysis, 5+ years PM experience with technical products",
    "salary": "$160,000 - $240,000",
    "education_required": "Bachelor's in Computer Science or related field, MBA preferred",
    "projects_required": "Shipped multiple successful technical products"
  },
  {
    "id": 38,
    "title": "Principal Applied Scientist",
    "company": "Amazon",
    "location": "Seattle, WA",
    "type": "Full-time",
    "experience": "10+",
    "visa_sponsorship": true,
    "description": "Lead applied science initiatives for Alexa or AWS. Define technical vision, publish research, and deliver products. Mentor scientists and engineers across org.",
    "requirements": "PhD in ML/CS, 10+ years experience, Deep Learning, NLP or Computer Vision, Publications, Leadership, Track record of product impact",
    "salary": "$250,000 - $400,000",
    "education_required": "PhD in Machine Learning, Computer Science, or related field",
    "projects_required": "Led major ML initiatives from research to production at scale"
  },
  {
    "id": 39,
    "title": "AI Engineer",
    "company": "Anthropic",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "experience": "3+",
    "visa_sponsorship": true,
    "description": "Build and train large language models. Work on model alignment, safety, and capabilities. Contribute to cutting-edge AI research while building products.",
    "requirements": "Python, PyTorch, Transformers, Large Language Models, Distributed Training, RLHF, 3+ years ML engineering, Research mindset",
    "salary": "$200,000 - $350,000",
    "education_required": "Master's or PhD in Machine Learning, Computer Science, or related field",
    "projects_required": "Experience with LLMs, preferably training or fine-tuning at scale"
  },
  {
    "id": 40,
    "title": "Robotics Software Engineer",
    "company": "Boston Dynamics",
    "location": "Waltham, MA",
    "type": "Full-time",
    "experience": "4+",
    "visa_sponsorship": false,
    "description": "Develop software for advanced robots like Spot and Atlas. Work on perception, planning, and control systems. Combine computer vision, ML, and real-time systems.",
    "requirements": "C++, Python, ROS, Computer Vision, Path Planning, Control Systems, Real-time systems, 4+ years robotics experience",
    "salary": "$140,000 - $200,000",
    "education_required": "Master's or PhD in Robotics, Computer Science, or related field",
    "projects_required": "Experience with real robots, not just simulation"
  }
]